"espk" = "Port de haut-parleur Apple";
"ispk" = "Intégré";
"emic" = "Port microphone";
"imic" = "Intégré";
"hdpn" = "Port de casque d’écoute";
"lini" = "Port d’entrée audio";
"lino" = "Port de sortie audio";
"spdi" = "Port d’entrée numérique optique";
"spdo" = "Port de sortie numérique optique";
"pci " = "Carte PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Périphérique de réseau";
"blue" = "Bluetooth";
"bluh" = "Écouteurs Bluetooth";
"blus" = "Casque d’écoute Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
